{
    "2025-09-09": {
        "Learning": "This has been some journey, it started back in 2022 and 3 years later the push is still on, the idea is to grow and become better which is very testing but at the same time if one slumbers and wait for things to happen then we will be caught pants down.\n\nThe world is rapidly changing and does not wait on any of us, so we make a mistake and wait for the right moment then we  are dead on arrival, the question then that we need to ask myself then will be what do we need to do to cushion ourself and the answer is pretty straight forward  just need to figure it out and we will make ourselves better.\n\nCompetition is pretty stiff and things are becoming pretty easy learn and master,  question still begs how do ensure that we don't run dry and  irrelevant in a world that irrelevance is becoming the order of the day?\n\nThe answer is pretty easy Make learning a lifelong journey"
    },
    "2025-09-10": {
        "Wisdom is the pain": "One of my favorite quote from Naval is \"the source of wisdom is the pain\", all of us want success and in this case success is not finance but rather making sense of life and getting something out of it.\n\nI look at this and at times i think this best is description of what crazy is, going for that goal, be it health, relationship or whatever, you not even certain if success is going to come through but you keep pushing regardless, you push for years and when it seem elusive then the fruits start to come through, this is how wisdom is acquired.\n\nWisdom is a journey, one that is pretty painful, but if you endure the pain, one grows to be better and wiser than most."
    },
    "2025-09-11": {
        "Journey of life": "I love athletics a lot, most of us are always excited for a race until we are in the middle of it and we cant stand it any more, quitting looks as failure and walking is like shame, so we are forced to drag ourselves along the way till we hit the finish line, i remember my first ever 21KM run, it was gruesome, a long the way, i walked for a few kilometers but generally was able to hit the crossing line.\n\nLife is like the same in every step of the way, there are days we just drag along to hit the finish line and get something off our backs, the beauty about life though there is nothing to be ashamed of and we are allowed to pause.\n\nThe journey of life  is like a marathon, in a marathon, the runners are given fluids and energy drinks for purpose of recharging, life calls on the same, pause reflect and make leaps going forward, the same helps with ensuring you able to endure and finish the race.\n\n"
    },
    "2025-09-12": {
        "Connection": "What is connection?\n\nThe best way to define it is through looking at mobile network -  look at how millions are connected through the mobile network, communication has been become easy and the distance bridged.\n\nI am looking at connecting the dots, if one sticks to something for long enough then a lot starts to make sense and progress becomes a reality"
    },
    "2025-09-13": {
        "Have fun": "Today i was just playing with a simple program where the idea was to common with a program that mimics a spin the wheel.\n\nIt worked this thanks to just 2 libraries :\n\nStream lit - for the frontend and pandas for data analysis \n\nThe exercise reminded me that all is very very possible - all that i need is to have fun in the process."
    },
    "2025-09-14": {
        "Reality Check": "The gap between the haves and have nots is like day and night and especially if one takes time to visit the gated communities of Muthaiga North - the place is extremely amazing.\n\nThere are farms that are still being pruned which is rare in Nairobi, these images keep playing in the head and should be a reminder to keep pushing, though success does not lie in the gated community but being able to figure out what you want in life and making it happen is indeed success.\n\nThe definition of success really lies with the person trying to define it."
    },
    "2025-09-15": {
        "Planting the seed hope": "Personally i survive on hope a lot, there is so much that i badly want as a person, there are days you knock on doors you think that you have won the battle truth be told you not even fought half the battle.\n\nThis is where hope comes through, it is where you keep pushing and use hope as a currency, until you run out of them, such a difficult phase, things stop to make sense but you just have to keep pushing no matter.\n\nIts difficult to tell when the switch will flip and though there is a blackout the seed of hope  just confirms that at some point the power will be back.\n\nIts just crazy!!!!"
    }
}